evaluation/two-services/interference-microbenchmark/service0-d200-poker50000000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=0
SLOWPOKE_DELAY_MICROS_SERVICE0=200
SLOWPOKE_POKER_BATCH_THRESHOLD=50000000
PROCESSING_TIME_SERVICE0=0.0002
PROCESSING_TIME_SERVICE1=0.0
bash run.sh synthetic two-services 8 512 40000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   205.22ms  105.00ms 602.76ms   61.71%
    Req/Sec   311.60    201.15     0.91k    66.51%
  Latency Distribution
     50%  202.14ms
     75%  285.32ms
     90%  336.37ms
     99%  463.79ms
  7132 requests in 3.02s, 2.85MB read
Requests/sec:   2359.31
Transfer/sec:      0.94MB
[run.sh] Speed is 2359.31, duration is 25
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d25s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
Running 25s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   199.16ms  114.86ms 837.15ms   65.08%
    Req/Sec   325.55    209.59     0.92k    64.81%
  Latency Distribution
     50%  194.32ms
     75%  278.24ms
     90%  355.57ms
     99%  482.57ms
  40000 requests in 25.00s, 15.98MB read
Requests/sec:   1599.99
Transfer/sec:    654.68KB
------------------------------
stop time: 15.610268
stop time: 15.609271
stop time: 15.596812
stop time: 15.610549
stop time: 15.607907
stop time: 15.647037
stop time: 15.611419
stop time: 15.823309
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
service0-645fbcb9c4-tjwfs        343m         43Mi            
service1-867fcbbd88-7chzc        102m         11Mi            
ubuntu-client-76886f6bbd-9nwbj   29m          0Mi             
[run.sh] Test finished with status 0